In [45]:
import pandas as pd
import numpy as np
import seaborn as sns

In [46]:
df = sns.load_dataset('iris')
df.shape

(150, 5)

In [47]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

## Count values

In [48]:
pd.DataFrame(df['species'].value_counts())

            species
setosa           50
virginica        50
versicolor       50

## Length

In [49]:
len(df)

150

<strong> Another form </strong>

In [50]:
df.shape[0]

150

## Unique number

In [51]:
df['species'].nunique()

3

## Overview

In [52]:
df.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.057333      3.758000     1.199333     NaN
std         0.828066     0.435866      1.765298     0.762238     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [53]:
df.describe(include=np.object)

       species
count      150
unique       3
top     setosa
freq        50

<strong> Another form </strong>

In [54]:
df.describe(exclude=np.number)

       species
count      150
unique       3
top     setosa
freq        50

## Others
<strong> sum, count, median, quantile, supply, min, max, mean, var, std</strong>

In [55]:
df['petal_width'].sum()

179.90000000000003

In [56]:
df['petal_width'].count()

150

In [57]:
df['petal_width'].median()

1.3

In [58]:
df['petal_width'].mean()

1.1993333333333336

In [59]:
df['petal_width'].quantile([0.25,0.75])

0.25    0.3
0.75    1.8
Name: petal_width, dtype: float64

In [60]:
df['petal_width'].min()

0.1

In [61]:
df['petal_width'].max()

2.5

In [62]:
df['petal_width'].var()

0.5810062639821029

In [63]:
df['petal_width'].std()

0.7622376689603465

In [64]:
df['petal_width'].apply(np.sqrt).head()

0    0.447214
1    0.447214
2    0.447214
3    0.447214
4    0.447214
Name: petal_width, dtype: float64

<strong> apply function with lambda </strong>

In [67]:
df.apply(lambda x : x[-5:])

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica